ext_b24/DataProcessors/алсавб24_api_CRM_УниверсальныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_api_CRM_УниверсальныеРеквизиты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеОбъектовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеОбъектовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ENTITY_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ENTITY_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_api_CRM_УниверсальныеРеквизиты/Ext/ManagerModule.bsl
// Модуль для работы с универсальными реквизитами CRM Битрикс24
// https://apidocs.bitrix24.ru/api-reference/crm/requisites/universal/index.html

//
// КОНСТАНТЫ PRESET_ID ДЛЯ РЕКВИЗИТОВ БИТРИКС24
//

// PRESET_ID для различных типов реквизитов
Функция PRESET_ID_Организация() Экспорт
	Возврат 1;
КонецФункции

Функция PRESET_ID_ИП() Экспорт
	Возврат 3;
КонецФункции

Функция PRESET_ID_ФизЛицо() Экспорт
	Возврат 5;
КонецФункции

//
// ОСНОВНЫЕ МЕТОДЫ РАБОТЫ С УНИВЕРСАЛЬНЫМИ РЕКВИЗИТАМИ
//

/// Получить список универсальных реквизитов
/// Параметры:
///  Фильтр - Структура - параметры фильтрации (необязательно)
///  Выборка - Массив - поля для выборки (необязательно)
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_list(Фильтр = Неопределено, Выборка = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	Если Фильтр <> Неопределено Тогда
		Параметры.Вставить("filter", Фильтр);
	КонецЕсли;
	
	Если Выборка <> Неопределено Тогда
		Параметры.Вставить("select", Выборка);
	КонецЕсли;
	
	Возврат ВызватьAPIМетод("crm.requisite.list", Параметры);
	
КонецФункции

/// Получить список реквизитов по фильтру crm.requisite.list
/// Параметры:
///  ENTITY_ID - Число - ID сущности в Б24
///  ENTITY_TYPE_ID - Число - тип сущности (по умолчанию 4 - Компания)
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_list_by_company(ENTITY_ID, ENTITY_TYPE_ID = 4) Экспорт
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("ENTITY_ID", ENTITY_ID);
	Фильтр.Вставить("ENTITY_TYPE_ID", ENTITY_TYPE_ID);
	
	Параметры = Новый Структура;
	Параметры.Вставить("filter", Фильтр);
	
	Возврат ВызватьAPIМетод("crm.requisite.list", Параметры);
	
КонецФункции

/// Получить универсальный реквизит по ID
/// Параметры:
///  ID - Число - ID универсального реквизита
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_get(ID) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("id", ID);
	
	Возврат ВызватьAPIМетод("crm.requisite.get", Параметры);
	
КонецФункции

/// Добавить универсальный реквизит
/// Параметры:
///  Поля - Структура - поля универсального реквизита
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_add(Поля) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("fields", Поля);
	
	Возврат ВызватьAPIМетод("crm.requisite.add", Параметры);
	
КонецФункции

/// Обновить универсальный реквизит
/// Параметры:
///  ID - Число - ID универсального реквизита
///  Поля - Структура - поля для обновления
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_update(ID, Поля) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("id", ID);
	Параметры.Вставить("fields", Поля);
	
	Возврат ВызватьAPIМетод("crm.requisite.update", Параметры);
	
КонецФункции

/// Удалить универсальный реквизит
/// Параметры:
///  ID - Число - ID универсального реквизита
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_delete(ID) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("id", ID);
	
	Возврат ВызватьAPIМетод("crm.requisite.delete", Параметры);
	
КонецФункции

/// Получить поля универсального реквизита
/// Параметры:
///  ID - Число - ID универсального реквизита
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция crm_requisite_fields(ID) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("id", ID);
	
	Возврат ВызватьAPIМетод("crm.requisite.fields", Параметры);
	
КонецФункции

//
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ
//

/// Вызвать метод API Битрикс24
/// Параметры:
///  Метод - Строка - имя метода API
///  Параметры - Структура - параметры вызова
/// Возвращаемое значение:
///  Структура - результат API вызова
///
Функция ВызватьAPIМетод(Метод, Параметры) Экспорт
	
	Возврат Обработки.алсавб24_api_CRM_Common.ВызватьAPIМетод(Метод, Параметры);
	
КонецФункции

/// Подготовить реквизиты для юридического лица
/// Параметры:
///  Контрагент - СправочникСсылка.Контрагенты - контрагент
///  ENTITY_ID - Число - ID сущности в Б24
/// Возвращаемое значение:
///  Структура - поля для создания универсального реквизита
///
Функция ПодготовитьРеквизитыЮрЛица(Контрагент, ENTITY_ID) Экспорт
	
	Поля = Новый Структура;
	
	// Основные поля
	Поля.Вставить("ENTITY_ID", ENTITY_ID);
	Поля.Вставить("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());
	Поля.Вставить("NAME", Контрагент.Наименование);
	Поля.Вставить("PRESET_ID", PRESET_ID_Организация());
	
	// Юридические реквизиты
	Если ЗначениеЗаполнено(Контрагент.ИНН) Тогда
		Поля.Вставить("RQ_INN", Контрагент.ИНН);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.КПП) Тогда
		Поля.Вставить("RQ_KPP", Контрагент.КПП);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент.НаименованиеПолное) Тогда
		Поля.Вставить("RQ_COMPANY_NAME", Контрагент.НаименованиеПолное);
	КонецЕсли;
	
	Возврат Поля;
	
КонецФункции

/// Зарегистрировать сопоставление универсальных реквизитов
/// Параметры:
///  ENTITY_ID - Число - ID сущности в Б24
///  Объект1С - ЛюбаяСсылка - ссылка на объект 1С
///  Наименование - Строка - наименование для TITLE
///
Процедура ЗарегистрироватьСопоставлениеУниверсальныхРеквизитов(ENTITY_ID, Объект1С, Наименование) Экспорт
	
	НаборЗаписей = РегистрыСведений.алсавб24_СопоставлениеОбъектовБ24.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ENTITY_ID.Установить(ENTITY_ID);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ENTITY_ID = ENTITY_ID;
	НоваяЗапись.ENTITY_TYPE_ID = Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_УниверсальныеРеквизиты();
	НоваяЗапись.Объект1С = Объект1С;
	НоваяЗапись.TITLE = Наименование;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

/// Подготовить реквизиты для физического лица
/// Параметры:
///  Контрагент - СправочникСсылка.Контрагенты - контрагент
///  ENTITY_ID - Число - ID сущности в Б24
/// Возвращаемое значение:
///  Структура - поля для создания универсального реквизита
///
Функция ПодготовитьРеквизитыФизЛица(Контрагент, ENTITY_ID) Экспорт
	
	Поля = Новый Структура;
	
	// Основные поля
	Поля.Вставить("ENTITY_ID", ENTITY_ID);
	Поля.Вставить("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());
	Поля.Вставить("NAME", Контрагент.Наименование);
	Поля.Вставить("PRESET_ID", PRESET_ID_ФизЛицо());
	
	// Реквизиты физического лица
	Если ЗначениеЗаполнено(Контрагент.ИНН) Тогда
		Поля.Вставить("RQ_INN", Контрагент.ИНН);
	КонецЕсли;
	
	Возврат Поля;
	
КонецФункции
